<?php
    $text['home'] = "الرئيسية" ;
    $text['about'] = "حول الموقع";
    $text['courses'] = "الدورات";
    $text['account'] = "الحساب" ;
    $text['sitemotto'] = "طريقك إلى الإبداع";
    $text['sitedesc'] = "هو موقع تعليمي يغطي كل ما كنت تسأل نفسك عن تطبيقات الويب. <br> دورات مفصلة تساعدك على فهم كل خطوة في هذا المجال العملاق.";
    $text['about-website-h2'] = "نحن نعرف كيف نبني معرفتك";
    $text['about-website-p'] = "تطوير الويب هو بناء وصيانة مواقع الويب";
    $text['intro1-h1'] = "ما هو تطوير الويب؟";
    $text['intro1-p'] = "تطوير الويب هو بناء وصيانة مواقع الويب ؛ إنه العمل الذي يحدث خلف الكواليس لجعل موقع الويب يبدو رائعًا ويعمل بسرعة وبأداء جيد مع تجربة مستخدم سلسة ...ـ";
    $text['intro2-h1'] = "كيف تطور الويب؟";
    $text['intro2-p'] = "يعد تطوير الويب من بين المجالات الواسعة ، لذلك يجب أن يكون المطور ماهرًا في العديد من البرامج واللغات لإنشاء شبكة ويب مثالية لتلبية جميع متطلبات العملاء ...ـ";
    $text['intro3-h1'] = "لماذا تطوير الويب؟";
    $text['intro3-p'] = "أحد أكثر التخصصات المطلوبة اليوم هو تطوير الويب نظرًا لأرباحه المالية كما أنه يعد مجال غير محدود، فهو قيد التطور مع كل جيل ...ـ";
	$text['start-now'] = "ابدأ الآن";
    $text['more'] = "المزيد";
    $text['our-courses'] = "دوراتنا";
    $text['our-courses-p'] = "قم بترقية مهاراتك من خلال الدورات الموجودة في الموقع";
    $text['card1-h2'] = "Front-End";
    $text['card1-tytle'] = "تطوير";
    $text['card1-info-p'] = "تعرف على الطريقة الصحيحة لتطوير مواقع الويب الثابتة";
    $text['card1-info-i1'] = " &nbsp حجر أساس";
    $text['card1-info-i2'] = " &nbsp تصميم عناصر التنقل";
    $text['card1-info-i3'] = " &nbsp إضافة تأثيرات واجهة المستخدم";
    $text['card2-h2'] = "Back-End";
    $text['card2-tytle'] = "تطوير";
    $text['card2-info-p'] = "تعرف على الطريقة الصحيحة لتطوير مواقع الويب الديناميكية";
    $text['card2-info-i1'] = " &nbsp  بناء وتطوير وتفاعل";
    $text['card2-info-i2'] = " &nbsp التعامل مع قواعد البيانات";
    $text['card2-info-i3'] = " &nbsp التعامل مع الخادم";
    $text['card3-h2'] = "Design";
    $text['card3-tytle'] = "الأساسيات";
    $text['card3-info-p'] = "تعرف على أساسيات التصميم";
    $text['card3-info-i1'] = " &nbsp UI/UX تصميم";
    $text['card3-info-i2'] = " &nbsp تصميم الغرافيك";
    $text['card3-info-i3'] = " &nbsp تعديل الصور";
    $text['check'] = "المزيد";
    $text['users-op'] = "آراء المستخدمين";
    $text['users-op-desc'] = "";
    $text['role'] = "الرتبة";
    $text['footer1-h3'] = "حول الموقع";
    $text['footer1-p'] = "عندما بدأنا الموقع ، كان هدفنا هو إعطاء أي شخص القدرة على تعلم المهارات التي يحتاج إليها لبناء شيء ذي معنى من البداية إلى الاحتراف";
    $text['footer2-h3'] = "العنوان";
    $text['footer2-p1'] = "start coding club";
    $text['footer2-p2'] = "بواسطة طلاب جامعة قسنطينة 2";
    $text['footer2-p3'] = "الجزائر";
    $text['footer2-p4'] = "eduweb399@gmail.com";
    $text['footer2-h2'] = "+213 6123123";
    $text['links'] = "الفهرس";
    $text['team'] = "الفريق";
    $text['setting'] = "الإعدادات";
    $text['opinions'] = "الآراء";
    $text['contact'] = "تواصل معنا";
    $text['sign-in'] = "تسجيل الدخول";
    $text['sign-up'] = "أنشئ حساب";
    $text['welcome'] = "مرحبا";
    $text['sign-in-pr'] = "إذا كنت تمتلك حساب بالفعل يمكنك تسجل الدخول";
    $text['sign-up-pr'] = "مازلت لا تملك حساب ؟ </br> أنشئ حسابا الآن";
    $text['create-account'] = "تسجيل حساب جديد";
    $text['errorlogin'] = "إسم المستخدم أو كلمة السر خاطئة";
    $text['goodsignup'] = "تم إنشاء الحساب بنجاح";
    $text['errorsignup'] = "هذا الحساب موجود من قبل";
    $text['eroordb'] = "حدث خطا ما";
    $text['your-name'] = "الإسم الكامل";
    $text['username'] = "إسم المستخدم";
    $text['password'] = "كلمة السر";
    $text['exmp'] = "مثال";
    $text['vall'] = "رؤية الجميع";
    $text['dashboard'] = "لوحة القيادة";
    $text['userdata'] = "بيانات المستخدم";
    $text['logout'] = "تسجيل الخروج";
    $text['design'] = "Design";
    $text['frontend'] = "FrontEnd";
    $text['backend'] = "BackEnd";
    $text['fecc'] = "صناع محتى الـ FrontEnd";
    $text['becc'] = "صناع محتى الـ BackEnd";
    $text['dncc'] = "صناع محتى الـ Design";
    $text['contactus'] = "اتصل بنا";
    $text['wlecomemsg'] = "اكتشف الميزات القوية التي تحتاجها<br> للمساعدة في إنشاء موقع الويب الخاص بك وإدارته!";
    $text['useropbutton'] = "إعطنا رأيك عن الموقع";
    $text['useroptext'] = "إعطنا رأيك عن الموقع";
    $text['useropsubmit'] = "إرسال الرأي";
    $text['userimgbutton'] = "تغيير الصورة الشعصية";
    $text['userimgtext'] = "تغيير الصورة الشعصية";
    $text['userimgsubmit'] = "تغيير";
    $text['usersitebutton'] = "شارك موقعك هنا";
    $text['site-name'] = "إسم الموقع";
    $text['site-section'] = "القسم";
    $text['site-category'] = "الفئة";
    $text['site-link'] = "الرابط";
    $text['site-descreption-eng'] = "وصف الموقع بالإنليزية";
    $text['site-descreption-ar'] = "وصف الموقع بالعربية";
    $text['site-descreption-fr'] = "وصف الموقع بالفرنسية";
    $text['site-img'] = "صورة للموقع";
    $text['site-submite'] = "شارك الموقع";
	
	
	
	
	
	$text['about-page'] = "<h1>ما هو تطوير الويب؟</h1>
       <p> تطوير الويب هو العمل الذي ينطوي عليه تطوير موقع ويب للإنترنت (شبكة الويب العالمية) أو شبكة إنترانت (شبكة خاصة). يمكن أن يتراوح تطوير الويب من تطوير صفحة ثابتة واحدة بسيطة من نص عادي إلى تطبيقات الويب المعقدة والأعمال الإلكترونية ، وخدمات الشبكات الاجتماعية. قد تتضمن قائمة أكثر شمولاً للمهام التي يشير إليها تطوير الويب عادةً هندسة الويب ، وتصميم الويب ، وتطوير محتوى الويب ، والاتصال بالعميل ، والبرمجة النصية من جانب العميل / الخادم ، وخادم الويب وتكوين أمان الشبكة ، وتطوير التجارة الإلكترونية. بين محترفي الويب ، يشير مصطلح تطوير الويب عادةً إلى الجوانب الرئيسية غير المتعلقة بالتصميم في إنشاء مواقع الويب: كتابة العلامات والترميز. قد يستخدم تطوير الويب أنظمة إدارة المحتوى (CMS) لتسهيل تغييرات المحتوى وإتاحتها بالمهارات التقنية الأساسية.</p>

      </article>
       
       <h1>كيف تطور الويب؟</h1>
       <p>إذا كنت مهتمًا بفكرة استخدام منشئ مواقع الويب ، فقد حان الوقت للبدء. هذه هي خطوات إنشاء موقع ويب جميل باستخدام أداة إنشاء مواقع الويب.

        <ol>

            <li>اختر منشئ موقع الويب الخاص بك.
                <p>   أول الأشياء أولاً ، تحتاج إلى اختيار منشئ مواقع الويب الذي تريد استخدامه. لديك عدد من الخيارات للاختيار من بينها ، واتخاذ القرار الصحيح مهم الآن. يجعل العديد من منشئي مواقع الويب من الصعب الحفاظ على موقع الويب الخاص بك إذا انتقلت إلى منتج جديد في المستقبل.  </p></li>



            <li>حدد القالب المفضل لديك.
            <p>  يبدأ إنشاء موقع ويب باستخدام منشئ مواقع الويب بنموذج. ابحث في الخيارات المختلفة المتاحة للعثور على خيار يتطابق تمامًا مع ما يدور في ذهنك لموقعك. لا تفكر فقط في الخيار الذي يعجبك بشكل أفضل - يمكنك بسهولة تغيير الكثير من العناصر المرئية لموقعك. النموذج الذي تختاره. فكر في أي واحد لديه أقرب هيكل وتخطيط لموقع الويب الذي تريد إنشاءه. هذا سيجعل جعلها تتماشى مع رؤيتك الفريدة أسهل.   </p></li>


            <li>اختر نظام الألوان الخاص بك.
            <p>يعتمد الكثير من إنشاء موقع ويب جميل كصاحب عمل أو مدون على الألوان التي تختارها. تريد أن تكون متسقًا مع الألوان التي تستخدمها عبر موقع الويب — إذا نقر شخص ما من صفحة خضراء وزرقاء إلى صفحة باللونين الأحمر والأسود ، فإن ذلك يخلق تجربة مربكة. وتريد أن تتأكد من التمسك بالألوان التي تبدو جيدة معًا ، سيساعدك إنشاء مخطط ألوان كإحدى خطواتك الأولى على تحقيق هذين الهدفين. ستعرف الألوان التي يجب الالتزام بها للخلفيات والخطوط والصور وعناصر الصفحة المختلفة. إذا كنت لا تعرف حقًا كيفية تحديد الألوان التي تبدو جيدة معًا ، يمكنك العثور على عدد من الموارد المجانية عبر الإنترنت للمساعدة. تصفح مواقع مثل Design Seeds و Color Hunt للإلهام. أو تحقق من أداة عجلة الألوان من Canva التي تستخدم نظرية الألوان لتمنحك مزيجًا مثاليًا من الألوان. وتتيح لك الأداة Coolers اختيار اللون الذي تريده ، والاطلاع على مجموعة متنوعة من أنظمة الألوان التي يتم إنشاؤها تلقائيًا والتي تتضمنها حتى تجد واحدة تحب. توفر كل هذه الموارد بشكل مفيد رموز الألوان لكل رقم ، بحيث يمكنك العثور عليها بسهولة في أدوات التحرير الخاصة بمنشئ موقع الويب الخاص بك أثناء عملك.</p></li>








            <li>إنشاء دليل نمط لموقعك.
            <p>   كما هو الحال مع نظام الألوان الخاص بك ، فإن إنشاء دليل نمط لموقع الويب الخاص بك في وقت مبكر سيساعدك على التأكد من أن أسلوبك متناسق عبر الموقع وأن كل شيء يبدو بالطريقة التي تريدها. لا يجب أن يكون هذا شيئًا طويلاً جدًا أو معقدًا. يمكن أن تكون قائمة أساسية بالملاحظات حول الخيارات الأسلوبية التي تريد استخدامها على موقعك. ضع في اعتبارك أشياء مثل ما إذا كنت تريد أن تكون العناصر والأزرار لديك زوايا مستديرة أو حادة. هل تريد أن تحافظ جميع الصفحات الموجودة على موقع الويب الخاص بك على نفس التصميم الأساسي؟ ما هو التلوين الذي تريد استخدامه للخلفيات والنصوص والروابط والأزرار؟ ما هو الخط الذي تريد استخدامه ، وإذا كنت تريد استخدام أكثر من واحد ، فما هي السياقات التي يجب أن تستخدم كل منها؟ يمكنك الحصول على بعض الإلهام من خلال النظر في أمثلة لأدلة الأنماط الأخرى ، ولكن يمكن أن يكون خطك أبسط بكثير من أي شيء كبير وضع العلامات التجارية معًا. يجب أن يكون بمثابة دليل يمكنك إعادة زيارته في أي وقت تعمل فيه على صفحة جديدة وتحتاج إلى تذكير بكيفية جعلها تتماشى من حيث الأسلوب مع بقية الموقع.  </p></li>




            <li>حدد أهداف موقع الويب الخاص بك.
            <p>على الرغم من أن هذا الجزء لا يتعلق بجعل موقع الويب الخاص بك جميلًا ، إلا أنه يعد خطوة مهمة في إنشاء موقع ويب فعال. كل شخص يقوم بإنشاء موقع ويب لديه شيء يريد تحقيقه. من أجل القيام بذلك ، يجب أن تكون استراتيجيًا في إنشاء موقع ويب مصمم لتحقيق أهدافك. اقض بعض الوقت في تحديد هذه الأهداف بوضوح. سيكون لديك بالتأكيد هدف شامل واحد - بالنسبة لمالك النشاط التجاري ، الذي سيحقق مبيعات جديدة ، وبالنسبة إلى موقع الويب الشخصي ، فمن الممكن أن يتواصل مع الأشخاص من خلال مشاركات المدونة التي تهتم بنفس الأشياء التي تفعلها. بالإضافة إلى ذلك ، من المحتمل أن يكون لديك عدد من الأهداف الصغيرة التي تساهم في تحقيق هدفك الأساسي: من الأمثلة القليلة المحتملة أن يلاحظك الأشخاص المناسبون ، واكتساب حركة المرور ، وإنشاء قائمة بريد إلكتروني. أهداف واضحة في الاعتبار ، ستعمل بشكل أفضل في إنشاء موقع ويب يتماشى مع ما تريده أن يكون ويفعله. وستعرف كيفية تتبع نجاحها بعد نشرها    </p></li

>






            <li>وضح رسائلك.
            <p>   لقد تحدثنا كثيرًا عن التصميم المرئي حتى الآن ، ولكن الصياغة التي تختارها ستكون مهمة لتحقيق أهدافك بقدر أهمية الجمالية المرئية. يجب أن يؤدي المحتوى المكتوب الذي تقوم بتضمينه على موقع الويب الخاص بك (يسمى نسخة في لغة التسويق) إلى القيام بالعبء الثقيل المتمثل في إخبار زوارك بما هو موقع الويب ولماذا يجب أن يهتموا به. قد تجد هذا أسهل إذا كنت تأخذ بعض الوقت للنظر في مواقع مماثلة وشاهد كيف تصف نفسها. يمكن أن تكون بمثابة مصدر إلهام لمساعدتك في توضيح رسائلك الخاصة ، مع توضيح ما تم القيام به بالفعل. من الناحية المثالية ، تريد تمييز نفسك عن مواقع الويب الأخرى وإبلاغ الزائرين بما يجعل موقعك فريدًا. اكتب عرض القيمة الفريد (UVP) ، وهو سطر أو سطرين يصفان ما يجب أن يقدمه موقع الويب الخاص بك وكيف يختلف عن أي موقع آخر. يمكنك وضع UVP مباشرة على الصفحة الرئيسية لموقع الويب الخاص بك ، وسوف يساعدك أيضًا في إرشادك في النسخة التي تقوم بإنشائها لبقية الموقع.  </p></li>







            <li>حدد صفحات موقعك على الويب وتنظيمه.
            <p> عامل مهم آخر في الحفاظ على فعالية موقع الويب الخاص بك هو التأكد من أنه سهل الاستخدام. لا تريد أن تفرط في تحميل الزائرين الكثير من المعلومات على صفحة واحدة - فهذا محير وسيء في الوقت نفسه لتحسين محركات البحث. لذلك اكتشف كيفية تقسيم كل ما تريد مشاركته إلى عدد من الصفحات التي يتم تخصيص كل منها لمقدار يمكن التحكم فيه من المعلومات. عندما يكون لديك فكرة عن الصفحات المختلفة التي ستنشئها ، فكر في أفضل طريقة لتنظيمها في ستسهل على الزائرين العثور على ما يهتمون به. اكتشف بعض الفئات الرئيسية التي تناسب صفحاتك المختلفة. من المحتمل أن تكون هذه هي عناصر القائمة الرئيسية الخاصة بك. إذا كان موقع الويب الخاص بك سيكون بسيطًا إلى حد ما ويحتوي على بضع صفحات فقط ، فلا ينبغي أن تكون هذه الخطوة معقدة للغاية. إذا كنت تتوقع أن ينمو موقع الويب الخاص بك إلى شيء أكبر بكثير يحتوي على عشرات أو مئات الصفحات ، فمن المهم تحديد بنية واضحة لموقع الويب الآن بعد أن ستلتزم بالمضي قدمًا.     </p></li>







            <li>ابدأ العمل على إنشاء موقعك.
            <p> الآن بعد أن انتهيت من كل الإعداد المسبق لمعرفة الشكل الذي تريد أن يبدو عليه موقع الويب الخاص بك وقول ، اسحب القالب الخاص بك وابدأ في إجراء التغييرات اللازمة. تأكد من الالتزام بدليل الأسلوب الخاص بك ونظام الألوان والرسائل وخطة المنظمة أثناء عملك. يمكن أن يكون من السهل الانشغال بإجراء تغييرات تبدو جيدة بمعزل عن غيرها ، خاصةً عندما يقوم منشئ مواقع الويب الشخصية أو التجارية بإجراء كل قرص صغير سهل جدا. لكنك قمت بكل العمل في هذه الخطوات لسبب ما وسيكون موقع الويب الخاص بك أكثر سهولة في الاستخدام وجمالًا وفعالية إذا اتبعت الإرشادات التي أنشأتها لنفسك.   </p></li>





            <li>قم بتشغيله بواسطة شخص آخر للحصول على رأي ثان.
            <p>  عندما تقضي وقتًا في العمل على موقع ويب ، فإنك تقترب منه كثيرًا بحيث لا تراه بالطريقة التي يراها شخص آخر. قبل أن تدفعه إلى العالم الأكبر ، ابحث عن صديق تثق به ليكون عينًا جديدة لك. قد يكونون قادرين على اكتشاف الأخطاء الطفيفة أو إعلامك إذا كان التنقل محيرًا بعض الشيء. استمع إلى ملاحظاتهم وقم بإجراء أي تغييرات يوصون بها والتي تثق بها ستعمل على تحسين موقع الويب.   </p></li>


           



        </ol>




       </p>

      </article>

      <article class='page2'>
       
       <h1>لماذا تطوير الويب؟</h1>
       <p>يقوم مطورو الويب ، أو « devs »، بذلك باستخدام مجموعة متنوعة من لغات الترميز. تعتمد اللغات التي يستخدمونها على أنواع المهام التي يؤدونها والمنصات التي يعملون عليها. هناك طلب كبير على مهارات تطوير الويب في جميع أنحاء العالم ويتم دفعها بشكل جيد أيضًا - مما يجعل التطوير خيارًا مهنيًا رائعًا. إنها واحدة من أسهل المجالات ذات الأجور الأعلى التي يمكن الوصول إليها حيث لا تحتاج إلى شهادة جامعية تقليدية لتصبح مؤهلاً.</p>



      </article>";
?>